[
{"review_id":"xQY8N_XvtGbearJ5X4QryQ","user_id":"OwjRMXRC0KyPrIlcjaXeFQ","business_id":"-MhfebM0QIsKt87iDN-FNw","stars":2.0,"useful":5,"funny":0,"cool":0,"text":"As someone who has worked with many museums, I was eager to visit this gallery on my most recent trip to Las Vegas. When I saw they would be showing infamous eggs of the House of Faberge from the Virginia Museum of Fine Arts (VMFA), I knew I had to go!\n\nTucked away near the gelateria and the garden, the Gallery is pretty much hidden from view. It's what real estate agents would call \"cozy\" or \"charming\" - basically any euphemism for small.\n\nThat being said, you can still see wonderful art at a gallery of any size, so why the two *s you ask? Let me tell you:\n\n* pricing for this, while relatively inexpensive for a Las Vegas attraction, is completely over the top. For the space and the amount of art you can fit in there, it is a bit much.\n* it's not kid friendly at all. Seriously, don't bring them.\n* the security is not trained properly for the show. When the curating and design teams collaborate for exhibitions, there is a definite flow. That means visitors should view the art in a certain sequence, whether it be by historical period or cultural significance (this is how audio guides are usually developed). When I arrived in the gallery I could not tell where to start, and security was certainly not helpful. I was told to \"just look around\" and \"do whatever.\" \n\nAt such a *fine* institution, I find the lack of knowledge and respect for the art appalling.","date":"2015-04-15 05:21:16"},
{"review_id":"UmFMZ8PyXZTY2QcwzsfQYA","user_id":"nIJD_7ZXHq-FX8byPMOkMQ","business_id":"lbrU8StCq3yDfr-QMnGrmQ","stars":1.0,"useful":1,"funny":1,"cool":0,"text":"I am actually horrified this place is still in business. My 3 year old son needed a haircut this past summer and the lure of the $7 kids cut signs got me in the door. We had to wait a few minutes as both stylists were working on people. The decor in this place is total garbage. It is so tacky. The sofa they had at the time was a pleather sofa with giant holes in it. And my son noticed ants crawling all over the floor and the furniture. It was disgusting and I should have walked out then. Actually, I should have turned around and walked out upon entering but I didn't. So the older black male stylist finishes the haircut he was doing and it's our turn. I tell him I want a #2 clipper around the back and sides and then hand cut the top into a standard boys cut. Really freaking simple, right? WRONG! Rather than use the clippers and go up to actually cut the hair, he went down. Using it moving downward doesn't cut hair, it just rubs against it. How does this man who has an alleged cosmetology license not know how to use a set of freaking clippers??? I realized almost immediately that he had no idea what he was doing. No idea at all. After about 10 minutes of watching this guy stumble through it, I said \"you know what? That's fine.\", paid and left. All I wanted to do was get out of that scummy joint and take my son to a real haircut place.\n\nBottom line: DO NOT GO HERE. RUN THE OTHER WAY!!!!!","date":"2013-12-07 03:16:52"},
{"review_id":"LG2ZaYiOgpr2DK_90pYjNw","user_id":"V34qejxNsCbcgD8C0HVk-Q","business_id":"HQl28KMwrEKHqhFrrDqVNQ","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"I love Deagan's. I do. I really do. The atmosphere is cozy and festive. The shrimp tacos and house fries are my standbys. The fries are sometimes good and sometimes great, and the spicy dipping sauce they come with is to die for. The beer list is amazing and the cocktails are great. The prices are mid-level, so it's not a cheap dive you can go to every week, but rather a treat when you do. Try it out. You won't be disappointed!","date":"2015-12-05 03:18:11"},
{"review_id":"i6g_oA9Yf9Y31qt0wibXpw","user_id":"ofKDkJKXSKZXu5xJNGiiBQ","business_id":"5JxlZaqCnk1MnbgRirs40Q","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"Dismal, lukewarm, defrosted-tasting \"TexMex\" glop;\n\nMumbly, unengaged waiter;\n\nClueless manager, who seeing us with barely nibbled entrees\non plates shoved forward for pickup, thanked us\nperfunctorily for our patronage;\n\nWe're from the Texas Hill Country;\ndown there, we jail critters \nwho serve up grub this bad,\nfor their own protection.\n\nNever, never, NEVER again\n(Back to Yard House for real food)","date":"2011-05-27 05:30:52"},
{"review_id":"6TdNDKywdbjoTkizeMce8A","user_id":"UgMW8bLE0QMJDCkQ1Ax5Mg","business_id":"IS4cv902ykd8wj1TR0N3-A","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Oh happy day, finally have a Canes near my casa. Yes just as others are griping about the Drive thru is packed just like most of the other canes in the area but I like to go sit down to enjoy my chicken. The cashiers are pleasant and as far as food wise i have yet to receive any funky chicken. The clean up crew zips around the dining area constantly so it's usually well kept. My only gripe is the one fella with Red hair he makes the rounds while cleaning but no smile or personality a few nights ago he tossed the napkins i just put on the table to help go with my meal. After I was done he just reached for my tray no \"excuse me or are you done with that?\"  I realize he's trying to do his job quickly but a little table manners goes along way. That being said still like to grub here and glad that there's finally a Cane's close to me.","date":"2017-01-14 21:56:57"},
{"review_id":"L2O_INwlrRuoX05KSjc4eg","user_id":"5vD2kmE25YBrbayKhykNxQ","business_id":"nlxHRv1zXGT0c0K51q3jDg","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"This is definitely my favorite fast food sub shop. Ingredients are everything, and everything I see and taste here tells me that they're using top-grade fresh ingredients. The brisket sandwich is probably my favorite... and it's the one my wife ALWAYS gets. Unlike her, I often bounce around the menu to try different things. Definitely a step up from Subway, Quiznos, Jimmy Johns, etc in my opinion. As with all of my reviews, I grade each place relative to what I perceive to be its peers - so five star compared to them.","date":"2013-05-07 07:25:25"},
{"review_id":"ZayJ1zWyWgY9S_TRLT_y9Q","user_id":"aq_ZxGHiri48TUXJlpRkCQ","business_id":"Pthe4qk5xh4n-ef-9bvMSg","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Really good place with simple decor, amazing food and great hospitality.\nVery impressed with the lunch portion. Although service took little extra time but I have no complaints since they are quite new in business. The green curry chicken was good and to the right spice balance I asked for. I will definitely recommend this place to others.","date":"2015-11-05 23:11:05"},
{"review_id":"lpFIJYpsvDxyph-kPzZ6aA","user_id":"dsd-KNYKMpx6ma_sRWCSkQ","business_id":"FNCJpSn0tL9iqoY3JC73qw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Awesome office and staff, very professional and friendly. I saw Adam Garling PA-C and his assistant, they were very friendly, professional, and helpful. I highly recommend Centennial Dermatology! I will definitely return for more visits.","date":"2017-07-18 18:31:54"},
{"review_id":"JA-xnyHytKiOIHl_ztnK9Q","user_id":"P6apihD4ASf1vpPxHODxAQ","business_id":"e_BiI4ej1CW1F0EyVLr-FQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Most delicious authentic Italian I've had in the US. You wouldn't leave this place unhappy. The setting is cozy and a perfect spot for VD, anniversaries, or a special date. They'll make you feel like you're in Italy.","date":"2015-02-16 06:48:47"},
{"review_id":"z4BCgTkfNtCu4XY5Lp97ww","user_id":"jOERvhmK6_lo_XGUBPws_w","business_id":"Ws8V970-mQt2X9CwCuT5zw","stars":4.0,"useful":3,"funny":0,"cool":1,"text":"I have been here twice. Very nice and laid back. I tried the weekend Southern menu and it was delicious! Collard greens, mac&cheese, ribs, BBQ chicken sandwich. The scone with clotted cream was divine!!!! The iced teas are very refreshing and I swear I drank a whole container myself both visits. \nThe second time I had soup, salad and a sandwich. The salad had this amazing (raspberry? strawberry?, I forgot) vinaigrette. The sandwich was good, but I was kind of disappointed with the soup. It was potato and tasted too \"milky\". \nThey change the menu often and now have a tea inspired one. Can't wait to go back and try it.\nThe owners are very nice and I hope they continue to do well.","date":"2009-10-13 04:16:41"},
{"review_id":"TfVth7UNfgilv4J3exPB3A","user_id":"s5j_CRBWDCCMDJ6r7AYqjQ","business_id":"PA61Rwk3AMwOEXHevA7nkg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Maria is VERY good at what she does with great prices, too! I've always had a hard time finding someone to fix my jeans just right and she did it! I'm short with a small waist and a bit of a butt :) So that means every pair of jean I get have to be altered.  And Maria does a wonderful job with reasonable prices.  She's done more than10 pairs of jeans and a few shirts and only one needed fixing.  I even lost weight and had to get a pair redone, it was a bit of a challenge but she did a beautiful job.","date":"2013-12-28 21:02:55"},
{"review_id":"Tyx7AxYQfSRnBFUIXUJwFA","user_id":"HJECayULRM-6xh2GCCvLiA","business_id":"l-nL4BmhzpZjcavooO48PQ","stars":4.0,"useful":2,"funny":1,"cool":1,"text":"ORDER In (Delivery) Review\n\nI discovered this place from the front desk of the airport hotel and they recommended it highly. I called to place my order for Delivery to my room. They were very accommodating.\n\nWon Ton Soup - nice broth and tender won tons.\n\nChicken with Diced vegetables and Cashews - again, fresh vegetables were used, and good sized pieces of chicken.\n\nCrispy Beef - much like a Ginger Beef, nice serving of Beef with a sweet chilli sauce. Very tasty.\n\nBroccoli in Garlic sauce - came with peppers,Onions , Broccoli was not over done.\n\nAll in all for Delivery , this was really good. I am used to going to Authentic Asian in Vancouver. This hit the spot, and they also sent me a nice tub of Chilli Oil because I like it Hot.","date":"2015-10-17 01:38:13"},
{"review_id":"wJMjt5C2y1RKgY0Xb9jhrA","user_id":"1YIQGP-a534nyksaweEFYA","business_id":"Naa6E0YU0Wr7jCuCE3pYtQ","stars":5.0,"useful":3,"funny":0,"cool":0,"text":"We purchased new office furniture from this location.  We were advised the shipment would arrive in 3 business days.  The shipment was delivered the same day as promised.  We received excellent service from the first step into their showroom at their location on Dean Martin, all thru the delivery.  Very positive experience and great pricing for the quality items we purchased.  Very pleased and will be purchasing more furniture from this store.","date":"2015-07-03 21:48:51"},
{"review_id":"QCxPzh7cuxJrLd6A_UTbpw","user_id":"qftVgPj_kRTildMDjwiqtg","business_id":"Ns4tjgLfqR1qawGlNFROBA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Everything that my husband and I tried today was amazing. I am glad I got to try something different of what I normally would because i was really pleasantly surprised. We also order one sushi roll because we had to try at least one and we loved it! Definitely will be coming back to try more things. Place is really small, and there was only one server, but we came when it was really slow and the service was pretty fast. All in all very happy we got to try this place out.","date":"2016-06-11 22:00:11"},
{"review_id":"qWHp2l2lysENZObh6MAulA","user_id":"5lb0POg2t-AkMFx6603cYQ","business_id":"ZlCSsWS07JulSBIQlrbF5w","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Called for a 5:15 morning reservation. The driver was here before 5 and didn't alert us, just parked outside quietly. Also he helped out with the luggage and responded to our request of stopping at a differmet place first. Overall 5 star service!","date":"2015-05-26 10:36:47"},
{"review_id":"mjbs5CL4eMu4o6_VtYhN3Q","user_id":"TF4C-F5iqavACQgKTrbjRA","business_id":"7Ka9Pd8X9SRHs1D5EcleLg","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"If I could give less than one star, that would have been my choice.  I rent a home and Per my lease agreement it is MY responsibility to pay their Pool Service company.  Within the last year they changed to PoolServ.  I have had  major issues with new techs every week, never checking PH balances, cleaning the filter, and not showing up at all 2 weeks in the past 2 months. I have had 4 different techs in the past 4 weeks.   I have emailed and called them and they never respond back nor even acknowledged my concerns or requests.  I cannot change companies but I'm required to still pay for lousy or no service.  Attached are a couple pictures of my pool recently due to one tech just didn't put any chlorine in it at all according to the tech who came the following week to attempt to clean it up.  Please think twice before working with these people.  No one wants to work with a business that doesn't return phone calls or emails.","date":"2017-08-07 21:36:36"},
{"review_id":"bVTjZgRNq8ToxzvtiVrqMA","user_id":"2hRe26HSCAWbFRn5WChK-Q","business_id":"d4qwVw4PcN-_2mK2o1Ro1g","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"10pm on a super bowl Sunday and they're already closed?? Weak, no wonder the hard Rock is dying off...","date":"2015-02-02 06:28:00"},
{"review_id":"Ne_2CSfcKIqXHmv_KC0uqg","user_id":"6sJN_HlM_uwpfLJ1puf1Fg","business_id":"oVuZtlCFg_zF090Nhtp0Ow","stars":4.0,"useful":3,"funny":0,"cool":1,"text":"A close friend was in town and so instead of taking him to a more well established joint, we decided to try the newly opened Choolah. We were not disappointed.\n\nI am a bit of an amateur chef myself and consider my palate to be fairly sophisticated when it comes to all kinds of South Asian cuisine. This is not authentic Indian food - we don't have rice and salad bowls - but it is good, wholesome, high quality Indian food.\n\nI ordered a bowl of rice, yellow daal and the koftas (meatballs). The daal was perfect, the way daal should be cooked. The koftas were a little bland for my taste, but otherwise not bad...soft and the right texture. Paired with the many sauces and onions and the whole dish was wholesome and rich and very filling. My friend ordered the biryani, which, while not bad, still isn't the way real biryani should be, and I come from a city known for its biryani - but then I still haven't found a single place in America that makes biryani the way they do it back home.\n\nThe ambiance is good and there's plenty of room to sit. The line moves quickly and at most you'll face a 10-15 min wait on a crowded day. The only issue I had was with the music - being a designer, it bothers me that the music selection to go with such great interiors  could have been better...I would expect Bollywood classics or Indian classical fusion instead of the usual loud pop music.\n\nTldr: if you're looking for authentically prepared and presented Indian food you'll be disappointed. If you're looking for high quality Indian-American food, this is a great place to get it. Will be coming back to try their tikka masala and chicken next.\n\nUpdate: went there again with a bunch of friends and tried their chicken tikka masala and pav bhaji. This is hands down the best Indian place in Pittsburgh - the bhaji is to die for. Make sure you sprinkle lemon on top and have the pav with mango chutney.","date":"2018-02-01 19:15:00"},
{"review_id":"Hy-gUXQh3RVhE8FLH9Dt4Q","user_id":"kMkWON2lmw0s-M-fwiuByg","business_id":"_iGvLfEsqDwPUxRUAe6tUw","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"Tried to have my car repaired.  Even made an appointment.  I was told that all my appointment was for is to meet the service advisor, not get any work completed on my car.  Such a waste of time.  Even talked to the Service Manager, he didn't care.  Since that was the attitude of the service department, I can only expect that from the mechanics that would have worked on my car.  Went to another dealership, made an appointment and my car went in to be repaired.  Not told to come back later and they might get to my car. Very poor service.","date":"2017-06-28 00:39:18"},
{"review_id":"UGErdm6bt48SXTVwJIti2Q","user_id":"QodunSzok4nIYFNrTSGesQ","business_id":"poSV39UqEg-gpESXafS9-g","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"My husband and I go there once a week since last year. We LOVE seafood. Unfortunately, I regretfully say that this place is a hit and miss for us. Some weeks are good, fresh and saucy. Some weeks can be completely opposite. I never thought about writing a review until our experience last week. \nWe ordered medium chicken wings and hot trifecta 2 lbs of shrimp. The wings came out SUPER spicy (probably hot) and the shrimp came out plain ( 99% butter and 1% spices). When we ordered we asked to make sure we have enough sauce but they came in almost dry. My husband and I love this place but we just never know what we will get that night. We just dodge the bullet and hopefully they will be better than last week.","date":"2018-03-04 01:03:53"},
{"review_id":"sybVjriZuCEH09zplkcXAw","user_id":"qkJtn0Rtz_lKlTs5azBkng","business_id":"tOhRQqiupLyJdBJVQMGOEQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"AMAZING. Simply amazing. Believe all of the hype and go out of your way to try this place. \n\nMy partner and I lucked out and ended up staying just a stones throw away. So, our first morning in Mile End, we popped in to give it a shot. We ended up going every morning (and once in the afternoon) after that because it was just that damn good. \n\nIt's cheap (like 85¢ and up), the staff speaks good English and those guys churn out wood fired bagel perfection 24 hours a day. \n\nI highly recommend the \"all dressed\" but just go and try everything. You won't be disappointed.","date":"2013-12-29 00:34:21"},
{"review_id":"TeX0eOIeZb_wpo86rCedXQ","user_id":"RR-2nouBn408e3djxC470g","business_id":"d4qwVw4PcN-_2mK2o1Ro1g","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Holy heck this place is amazing. I love their chicken tacos they're by far my favorite. Great customer service and all round awesome experience.","date":"2017-02-09 04:25:03"},
{"review_id":"sgTnHfeaEvyOoWX4TCgkuQ","user_id":"A0j21z2Q1HGic7jW6e9h7A","business_id":"9Jo1pu0y2zU6ktiwQm6gNA","stars":4.0,"useful":24,"funny":19,"cool":20,"text":"Coconut's Fish Cafe is a fantastic, Five Stars fish cafe.\n\nThe five of us drove here on our lunch hour and lucky us, there were only a few customers in line. Nice!  A good sign, when UR working against a clock. \n\nI ordered the Póke (Photo) for $11.99 which was outstanding.  I love fresh Tuna and Coconut's might be some of the best I've every had.  Order it and see!\n\nMy coworkers ordered, the Chicken Tacos for $11.99, Steak Tacos (Photos) for $11.49, Fish Taco for $10.99 and a cup of Chowder for $5.74. Add in a few IPAs, or soft drinks and we all averaged about $15 each.\n\nI tried my friend Josh's Fish Tacos and his was great, too.  So why they Four Star review, Georgie? Well the non fish group thought theirs was average. Okay, so you go to a place called Coconut's Fish Cafe and you order chicken and steak?  I'm sorry, that is so LOL. \n\nStep away from the meat taco guys and no one will get hurt!  Order the Poke, Fish or Shrimp Tacos and you'll fall in love with Coconut's Fish Cafe as I did.\n\nEnjoy!","date":"2016-12-04 03:15:21"},
{"review_id":"vZvF9HpLUmP3dKUYqv7HHw","user_id":"2Fi20wCPWrWWvuKDssePeA","business_id":"veQpiduzq83yYc0jQzCIPQ","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I love the classes at this gym. Zumba and. Radio Hip Hop are my favorite. This is such a great fun and I love that it is so reasonably priced!","date":"2017-05-13 05:19:38"},
{"review_id":"XvLG7ReC8JZmBltOLJzfcA","user_id":"-Co-ReNx_lXT1xL_Rr0B2g","business_id":"XZbuPXdyA0ZtTu3AzqtQhg","stars":4.0,"useful":0,"funny":1,"cool":0,"text":"As the previous person posted, what more can really be said about this restaurant. I just came back from Vegas this morning and a truly truly horrible experience.  I only went out there for a concert and the concert and this restaurant were the best parts of my trip.  I went in here accidentally, meaning, i had no clue it was Bobby Flay's restaurant. I was hungry and Caesars Palace was a across from where I was staying and all the restaurants in my hotel were packed and had lines, I walked right in with no waiting. (I will assume now that since its Bobby's place this place can get crowded so I feel the need to note this was a Sunday about 11:45am) Once inside Caesars Palace, I went to the first restaurant I saw, which was this one.  I realized mid-meal it was his restaurant when the waiter at the table next to me was explaining to the recently seated couple that \"Mr Flay likes a little spice so beware all of our dishes have a little kick\" (they were an older couple). I know i'm slow after he said that, that's when i realized why they had his cookbooks in the front. :)  (but like i said had a horrible trip so i wasn't even looking for things like this) anyway onto the food.\n\nFOOD: fantastic.  I went on sunday and i got the eggs and aged striploin tortilla (fancy name for steak and eggs) and  it was yummy.  It came with all this spices of sorts (well they werent spices). I am not really sure how to describe it, more like the consistency of salsa's but they werent salsa's, at any rate it was really good mix with the eggs.  I had a side of home fries which were a little burnt but oh well.  The steak was very good, very flavored, moist and tender. Overall very good. Had a cappuccino too, also very good. I wish i had tried the crabcake's but i knew i wasnt going to eat all that. waiters were awesome, just the right amount of attentiveness. (I personally hate when waiters\/waitresses, come back every 5 minutes, is everything ok is everything ok...sheesh can i enjoy my meal?) \n\nAnyway like i said, i had a horrible experience in vegas and this and the concert i went to see were the best parts about my trip, very glad i blessed up on this place.\n\nP.S.  Take notice, i have never eaten in a celebrity chef's restaurant and noticed that there were no salt and pepper shakers on any table.  ha just a fun tidbit, i thought that was funny and very interesting, almost as if the chef is subtly saying \"you will not mess up my dish with your spices\"","date":"2009-10-13 09:50:48"},
{"review_id":"mM8i91yWP1QbImEvz5ds0w","user_id":"TZQSUDDcA4ek5gBd6BzcjA","business_id":"qUWqjjjfpB2-4P3He5rsKw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"In the heart of Chinatown, I discovered it enroute to Kensington Market one day. It's quite hard to see, if you don't know it's there. First experience was very positive - would definitely return!\n\nATMOSPHERE: Small space. Think Banh Mi Boys, and other trendy over-the-counter eateries. Vibe is casual. Free WiFi is nice.\n\nSERVICE: Okay. Staff does their job, but not overly helpful upon entering the space. Maybe because it's an over-the-counter style place, but it would have been nice to be walked through their ordering process and menu.\n\nPRICE: Average. Depends on the size of pizza you order.The small pizza ($7-9.50) is filling for one. Large size pizza ($13-18.50) is good for sharing... or one VERY hungry person.  Pasta portions are very generous for the price tag ($9-14)\n\n\nFOOD: My friends and I were here for the first time, and we thought it was a pizza place so we all ordered pizza. It wasn't until we were waiting for the food to come, that we looked around and realised EVERY other table around us only had pasta on them. Guess we gotta come back to try! We did notice that the menu said their pasta is homemade. So will definitely come back.\n\nHere's the pizza we ordered:\n\nPeking Duck Pizza - Very tasty! Rich flavours that work well. But it's heavy, so come hungry - or order to share.\n\nMargherita - Good, but not the best. I recommend trying the more \"special\" toppings instead.\n\nShall return, and\/or try other locations.","date":"2017-06-06 19:04:10"},
{"review_id":"-u8Oz_iSZACGwWW_pIT4zw","user_id":"UreiTV1I9i-XF6_bJhK6Iw","business_id":"d_q4avZYM1sOlQP7noJKVg","stars":4.0,"useful":0,"funny":0,"cool":1,"text":"Always a fun outing to come for great hot dogs and ALL the fixings!  A great place to bring out of town company for a good lunch a new experience.","date":"2018-04-15 11:13:11"},
{"review_id":"09qxjFi4abaW66JeSLazuQ","user_id":"mbdtyUUzZZx5ld1Qc4iGtQ","business_id":"wkzWdo1mBqbzR2KPoXtWZw","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"Was a Chicago style deep dish.  Homemade type crust, good sauce. I ordered extra cheese, Italian sausage, canadian bacon and jalepeno!!\nWas GOOD AND definitely filling!!!","date":"2010-08-21 01:19:17"},
{"review_id":"K-wdPGHbErfxbKK6PetrmA","user_id":"FCoXqPxuI7GRBYyzJIwVxw","business_id":"r4HkiC71nB9k8Fe8zIORFQ","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"First time eating there and everything was so yummy! Great pizza and Salad, my son had the meatball sub he said it was very good, must have been because he wouldn't share. Highly recommend.","date":"2015-12-05 02:16:06"},
{"review_id":"01DNCgnW8K6xSyv4krYa1w","user_id":"XivuRnPq3D-K5cPiBTztIA","business_id":"oyjkEn5fAqcGNsBbqc8LTw","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"Just... not good.  We want it to be - we have been several times hoping, but the experience is always at best, lackluster.  The food is not great, very run-of the mill on a good day and the serve staff though very nice is always - and I have never had the same person twice - always totally lost and under-trained.  It blows my mind because they can't possibly know alcohol laws if they don't know anything about the menu - going to bite that company one day.  I am not sure but I think someone I know told me they do the shared tip thing and I thought maybe that may be why but I know another place that does that and the service is excellent.  I don't know what the problem is - I have worked in the industry before while in college and I would say front of the house training needs big overhaul.  At any rate, they have lots of TV's and it is closer to us but just plain not good.  I wish they would switch locations with Wild Wing Cafe - also chain-y but much better food and service.","date":"2016-04-11 16:42:13"},
{"review_id":"WGbtqQMeJwTVg6DFb156EQ","user_id":"K5MSNpwRf0xKQSaC6gK9Cw","business_id":"PL3cimEUfNHlenOGSOAdJg","stars":4.0,"useful":3,"funny":0,"cool":1,"text":"This was our choice, by default, for New Year's Eve dinner this year. See, we chose not to make reservations, but instead just wing it and see where we could get in. They had some early dining availability, so we jumped on it. Their special New Year's \"Paint the Town Gold\" menu did not disappoint.\n\nLocated in the beautiful Mandalay Bay restaurant row, Kumi is a gorgeous display of style and food artistry. Every course was surprisingly delicious, and plated interestingly.\n\nService was very good, seriously on point. Right up until the dessert course...after 30 minutes of waiting for it, we finally requested the check as we had an event to get to. One of our attendants felt bad and offered to quickly grab it for us but we were in danger of being late so we opted not to take him up on it. \n\nIt's a beautiful, albeit very pricey experience for dinner. We would return for special occasions only.","date":"2017-01-02 05:24:56"},
{"review_id":"PTk6YHmk2U7X-A7Js-VtNA","user_id":"bVwp0gnz3YxpJqSfXZrONg","business_id":"YyxB3K1ORzc7ChMKgyxm9Q","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"The employees are so friendly and hard working! Keep it up! The store is very clean... I love subway sooooooooo much!!! :)","date":"2014-10-27 04:30:55"},
{"review_id":"NHQWhZve7UEaGLt7IwAyDw","user_id":"H3wPBzQCKCKiHcV7GZK4kg","business_id":"LkMtMHVetws5_7QfRjPtlg","stars":2.0,"useful":5,"funny":3,"cool":4,"text":"This actually used to be one of my favorite hotel\/casinos back in the day.  Oh, how things have changed.\n\nThere are some goods, however.  If you are a conventioneer, you have instant and direct walking access to the main convention center.  But don't think about parking here for said conventions.  $30 a day for parking, Hilton?  Seriously?  That's robbery.  And greed.\n\nThe biggest disappointment is the killing off of Star Trek: The Experience over two years ago.  Despite this place being off-Strip, I made it a point to go here because they had such a fun and unique attraction here.  It would be one thing if they had something in mind to replace it, but either poor planning or the economy.... It's dead, Jim. \n\nThe \"Space Lounge\" is still there.  An entire casino area with a heavy sci-fi theme to it.  Except there's no casino here.  It's a huge space themed area with a ghost town bar, no slots, a few couches, a makeshift stage, beer signs, and a few remnants of Star Trek themes.  All of this space, and nothing.  No life to it.  Couches and beer signs only make the emptiness and waste of the area seem more empty and pathetic.\n\nWith their main draw gone, what has replaced it as the headliner?  Benihana's.  Nothing wrong with the restaurant, but it's hardly unique or exclusive, even in Vegas.  The Hilton has a Pizza Hut Express here too.  Maybe they should promote that as their \"big draw\" on the marquee as well.  A huge Benihana sign covers up the old entrance to Star Trek.  With couches pushed in front of the entryway.  Again, just sad, and I'll be a big man in saying that they kind of broke my heart getting rid of one of my most beloved hang-outs here.\n\nThe arcade is dead as well.  Another blanketed off space that sits and collects dust.  Again, with two-plus years, no suitable replacement has been found for anything in this section.  A few shops that fluctuate, but that's it.  This is a lot of dead space to go unused.  \n\nThere's also the issue of the Men's bathroom in the main casino area.  Above every urinal is a picture of a lust-crazed girl staring over your bits with a camera, magnifying glass, tape measure, etc, while you pee.  The first time I saw this, it was \"ha ha\" funny, then when the laughter died, it just turned creepy and weird for me.  I actually selected a urinal based off which girl creeped me out the least.  She merely looked like she was casting spells at my nethers.  I could live with that.\n\nLadies: I must know.  Is there something like this in the girl's restroom?  When you close the stall door to do your business, is there a picture of some crazed guy making grabbing motions where your boobs would be?  Please message me and let me know.  I'd really like to know what the Hell you get in your bathroom after my gender's discovery.\n\nAs critical as I am being, there looks to be some sort of steampunk-themed club called \"Triumph\" there.  I want to check this out.  Atonement for the death of my beloved Warp Core Breach booze bowl?  We'll see, but it's going to have to be pretty good to replace the hole in my heart from that much booze for so cheap a price.\n\nThe sad part is, Hilton's one of those \"history rich\" casinos here.  Look up the history on this place.  A lot of awesome stars and vintage Vegas stuff happened here, which makes you wonder why this isn't represented more.\n\nThis place is great for convention visitors to stay, but that's about it as far as I can see.  They need to figure themselves out for everything else.","date":"2011-01-09 00:09:50"},
{"review_id":"x7g2FrewC9Qpq1y7q7UCwA","user_id":"nVK00oKUk4asStkaOR09uw","business_id":"ZbHE1ZncONeH-q93GuVGdA","stars":1.0,"useful":1,"funny":0,"cool":0,"text":"Horrible- Unclean, rancid, foul odors, unkempt, and poor service. The restaurant was nearly empty, and the cashier didn't even look up to say hello as my husband stood hungrily grinning at the counter. Needless to say, I talked him into driving up the road to the other location. This one is unacceptable.","date":"2017-10-02 03:18:11"},
{"review_id":"2mLlQ9n5Ln_fykOuX_b0-A","user_id":"EZ6g9a17UdMjtR-wrZebmA","business_id":"wSAGILK2CFbq5BVZ5D67-A","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"The service is attentive. The decor attractive. But the menu is far too doused in polenta and paprika. The fingerling potatoes? Drenched in paprika. The aioli?Mixed with paprika. The appetizer? Fried polenta. The fish? Polenta crusted. It's worth a try. But be forewarned. The chef must shop at Costco.","date":"2015-06-21 00:07:59"},
{"review_id":"gbibui7sKs7QUTu5pF9TRw","user_id":"B03NtjnS1Ca4vHPN4S8s-A","business_id":"JHyv6TwbNfIcjpos8_espA","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"This is a wonderful nail shop! Eric the owner is so hospitable, he takes time and effort on your nails to perfect them! I love my nails, they're so cute and symmetrical. Definitely will be coming back to this spa and salon! If you're thinking about going, Don't even question it, just go!","date":"2015-07-28 07:19:02"},
{"review_id":"-cRD6URpwks2GvP6qy8x4Q","user_id":"6UR0kNe3C-ivlF2x1fPHNQ","business_id":"WUmosjOxt_8nWByHgm8Kkg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Who knew?\n \nI did! \n\nI remember eating many many many times way back in the early childhood of Chipotle back in Denver. Like the picture on the wall in every Chipotle. (yep on evans and university) I had a feeling this place was going somewhere and Chaching!\n\nAnyway, long story short, as we all have eaten at a Chipolte somewhere. It simply is the best quick healthyish mexican there is period! \n\nOn a side note if you are one of those wierd vegan people this is my favorite burrito (veggie fajita black w\/ all the salsas no queso or crema greens and of course 3 lbs of guac!) Yuuuuuuuuuuuuummmmmmmmmaaaaaeeeeeee!!!!!","date":"2011-01-08 23:13:25"},
{"review_id":"Ymb8ZYPg2e8dvqhdj3Gkqw","user_id":"hHFSpKcnDtJOs6M-JKFZ8Q","business_id":"oCvxJBOs-Mbg-4oanPO7lQ","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"The ingredients are always fresh and I like that I can customize everything. The price for the pita\/salad is reasonable, but after the delivery fee of $3, it can be pricey. Definitely a great option if I forget my lunch at home.","date":"2016-10-26 14:53:42"},
{"review_id":"nQxoDWJ5kIwjYZhFILqVWQ","user_id":"lJBI50awi0N8qvX4PKzH7Q","business_id":"3n685UjMonF4fjBcILXkJg","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Room was very clean.  Staff was exceptionally nice for a mid-level hotel.  It had a parking lot right out the front door.  The free breakfast seemed generous (I didn't partake).\n\nWhat more can one ask?  \n\nI'd stay here again.","date":"2017-08-16 11:21:42"},
{"review_id":"Qee78a9rXvSfyVhCO9EK7A","user_id":"NFebN50n-oXI7xgjP-Qixw","business_id":"k1c_bC3DK6mKg797vH1T8w","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"A very busy restaurant, make reservations, but well worth it.    Our party ordered the short ribs, salmon and steam bass for our main entrees and each dish was outstanding.   Will definitely go back to this restaurant when we are back in the Phoenix area.","date":"2015-03-18 17:46:46"},
{"review_id":"TkcxD1A4N_9kRZwGhUjDKA","user_id":"bgG0jJyUXta_kczGrQW2Rw","business_id":"7EZ4Eu7YJ1ltRCC5jXFJrQ","stars":1.0,"useful":1,"funny":0,"cool":0,"text":"There wasn't one specific thing that made this buffet so horrible... It's just the accumulation of everything being less than average quality. There are plenty of options, but none of them were flavorful, hot, or worth filling up on.\n\nSome others have commented on the dessert section being worthwhile, but to us everything tasted unthawed and on the stale side. The Asian section had probably the best offerings but all were still fairly bland.\n\nThe worst part is that when I was going to grab a slice from the pizza station, someone had placed the tongs directly on TOP of the pizza... So all the hand germs were in direct contact with the food! There were two workers right there who didn't think this was disgusting.. I would have discarded the slices.\n\nMy husband and I both left with unsatisfied stomachs and looked forward to the second dinner we would have a few hours later at a much better establishment.","date":"2013-04-10 16:19:12"},
{"review_id":"vPDLvkNLtyiBTRbt-wIeLw","user_id":"QIy3iLXjBUBqRzwd2lnWGQ","business_id":"_ZfjpSEO5ntk-1hbnwCR4g","stars":3.0,"useful":5,"funny":1,"cool":4,"text":"I stayed here back in April. Friday-Sunday. It's a nice hotel and the room had a great view. This is just another building that is part of the Palms. It has no casino and is just used for rooms. \n\nWe had the two room suite with 3 bathrooms, and 2 full kitchens. The main bathroom had a huge shower. I swear you can fit around 12+ people if thats what you want to do ;) They also have a tub in the middle of the room so you can watch your girl take a bath? lol The place was beautiful but was it worth the $2000?? I'd say yes, but the only major downside is that it's far from the strip. Would I do it again? Probably not since you can get a nice suite for the same price at a nice hotel and be on the strip. Another downside was that you cannot go out onto the patio. They lock all the sliding doors. That was a big downside for me!","date":"2012-08-15 01:33:11"},
{"review_id":"o3kyWgk5ZMW1KlLw6-tv2g","user_id":"FmQxARdHGnkclvcVWGEAxw","business_id":"VnOGWODJ7ZREYij0rpB-Xw","stars":3.0,"useful":1,"funny":0,"cool":0,"text":"Had brunch here Sunday with a friend. The meal was very good. I mean the options were limited but over all a solid brunch! I've only come to Brewsters on one other occasion so I can't speak to the service before as it was at another location in Calgary. The place wasn't busy. The staff was rather slow but the food was good so no complaints on that.\n\nI had the southwestern omelette and I LOVED the salsa inside it was so yummy and really added a nice touch to the meal. Prices were also fair. I decided to branch out from my usual egg benny. It was a nice change.","date":"2013-11-14 05:08:28"},
{"review_id":"HftK8hqRDgmgchNLlpqJHQ","user_id":"Arf9ddxVvO3PsmdZlPBDyA","business_id":"YJ2Y_asLIlbo-uijVugLow","stars":5.0,"useful":0,"funny":0,"cool":2,"text":"As a spicy food fan, when I see a restaurant called Hot & Spicy, I add it to my must try list.\n\nI decided to give Radica's a shot shortly after seeing the title of the restaurant. On first glance, the restaurant was super clean and new. A really nice environment for a fast food style joint! \n \nBetween my fiance and I, we ordered two roti's - one spicy chicken and the other a medium goat roti. Oh boy, the roti's were awesome! Fresh, packed with flavor and actually spicy.  Portions were huge as well! \n\nWe also tried a shrimp double. This was my first time trying a double. It was ok, but the real star of the show was the roti's.\n\nIf you're looking for genuinely good roti with a kick of spice, I'd say this is the spot!","date":"2015-06-08 18:24:07"},
{"review_id":"nAm92_-WUQ084x9Uz9iFmA","user_id":"iFEM16O5BeKvf_AHs6NzUQ","business_id":"9Eghhu_LzEJgDKNgisf3rg","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"Was super excited to bring my boyfriend to this Scaddabush location after going to the Richmond Hill location months back with friends and have been craving their mozzarella balls ever since! \n\nWe arrived and were seated at 8:15, and since reviewing the menu before hand, we placed out order with our waitress right away. We ordered the 'Naked' mozzarella to start and for mains the Penne Bolognese and Margherita pizza. \n\nThe waiting game was okay, we got our appetizer about 25 mins of waiting. Once arriving, the first thing I noticed was how small the mozzarella ball was compared the he Richmond Hill location. However, it was delicious ! I was reminded on why I chose this restaurant for dinner. \n\nAs for the mains, we waited and waited and waited. We had seen a male (possibly manager?) walk around with pizza slices and deliver them to some tables, however not ours. As he went to the table next to us we could overhear him apologizing for the wait time for their meals. \n\nAt around 9:05 our meals did arrive. The pizza was good,  definitely not enough cheese but will do. My boyfriend did really like his pasta. \n\nOverall, I would say I would come back to Scaddabush. Possibly just for the mozzarella balls but as our mains were just okay and nothing special, wouldn't choose this location for a full dinner again.","date":"2016-08-25 16:25:12"},
{"review_id":"a9bcki-Jt26TtUoNRGjQHg","user_id":"4xIRICDNx33zPG-CYshTXQ","business_id":"IhNASEZ3XnBHmuuVnWdIwA","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"If you are looking for something refreshing and delicious, this is your one stop shop! I've tried two drinks here and their delicious Japanese styled crepe that was filled with nutella and mouthwatering strawberries and bananas. There are other options as well. Their drinks are very customizable and if you think it's not perfect even after you get it, you can get it adjusted. The service is super friendly and the aura is welcoming. It's a clean environment where all the senses are in for a treat though the mesmerizing smell from the freshly made crepes, the refreshing sip from their drinks, to the perfect texture of their boba. I'm not from the area but anytime I'm on my way to Vegas, I'm stopping by first to get my boba fix. \n\nTry the Hawaiian Paradise. You won't regret it.","date":"2015-07-16 06:46:29"},
{"review_id":"8qdikDQ0bkJj7QZa2IdvrQ","user_id":"7MXunAzrmnbBd0XQR33zaA","business_id":"nJcyfIRGbI31EGLzillWYg","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"A margarita in clear plastic dickie cup??? Wtf?? The drunkin shrimp plate should of been called the goldfish feeder shrimp platter..","date":"2015-01-18 16:12:27"},
{"review_id":"xFjo0v7PmYWZRI3tK2WPuA","user_id":"jqEbD-d5iI5nrwhfMmX_5w","business_id":"8OeHn9KCbICuRBs_XiDDUA","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"Happy to give a strong recommendation to this place - fun atmosphere, great service, excellent food... and really loved the made-at-the-table s'mores!\n\nI recommend this for anyone who has out of town guests for a little bit of the 'old west' and good fun.  All you can eat BBQ on Saturday and Sunday during the day.","date":"2013-06-24 04:49:52"},
{"review_id":"slmv7dEs9FD3KsdbywTHUw","user_id":"Ir__fU1m6dBqgTrP3aLP9A","business_id":"KalAJyO0Zpg3K1wVwYXBHA","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"I have been coming to this sweet little place for years and think they deserve my compliments.\nThe food is french in a not too serious and snobbish way. \nThe wine is best enjoyed outside in the evening overlooking the \"lake\". They have live music (jazz guitar or piano) outside in the evenings most nights as well. Probably,one of the more romantic night spots on the west side. \nThey also have a fantastic lunch menu, with a lobster salad croissant that is true bliss..... mmmmmm....\nLook them up for their specials, like wine tastings and discounted days.","date":"2009-05-20 02:16:00"},
{"review_id":"T9T3PFKevNu-EhqwJF21pA","user_id":"YX1apap1DCOmOer3C9X2qw","business_id":"77KuSFMOXqRGqcV9NJjzDA","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"Food was piping hot, which is great!! Had the buffet...and it truly is all you can eat!! You order whatever you want off the menu (except chitlins) and they bring it out to you!!! Mac n cheese, greens, and black eyed peas were pretty good!! Fried chicken was pretty good too! Will come back!!","date":"2015-07-03 21:35:49"}
]
